In [55]:
import numpy as np
import pandas as pd
import os

##  nifty df

In [56]:
niftySingle = pd.read_csv('niftySingle.csv', usecols=['Date', 'Close'], index_col='Date')
niftySingle.rename(columns={'Close' : 'niftyPrice'},inplace=True)
niftySingle.insert(0,'company', 'nifty50')
niftySingle

            company    niftyPrice
Date
2012-01-03  nifty50   4765.299805
2012-01-04  nifty50   4749.649902
2012-01-05  nifty50   4749.950195
2012-01-06  nifty50   4754.100098
2012-01-09  nifty50   4742.799805
...             ...           ...
2023-04-26  nifty50  17813.599609
2023-04-27  nifty50  17915.050781
2023-04-28  nifty50  18065.000000
2023-05-02  nifty50  18147.650391
2023-05-03  nifty50  18089.849609

[2778 rows x 2 columns]

In [57]:
list_of_companies = os.listdir('C:\\keshav\\Navneet_sir_all\\Nifty50_dashboard_levels\\Nifty50_Data')
list_of_companies

['ADANIENT.NS.csv',
 'ADANIPORTS.NS.csv',
 'APOLLOHOSP.NS.csv',
 'ASIANPAINT.NS.csv',
 'AXISBANK.NS.csv',
 'BAJAJ-AUTO.NS.csv',
 'BAJAJFINSV.NS.csv',
 'BAJFINANCE.NS.csv',
 'BHARTIARTL.NS.csv',
 'BPCL.NS.csv',
 'BRITANNIA.NS.csv',
 'CIPLA.NS.csv',
 'COALINDIA.NS.csv',
 'DIVISLAB.NS.csv',
 'DRREDDY.NS.csv',
 'EICHERMOT.NS.csv',
 'GRASIM.NS.csv',
 'HCLTECH.NS.csv',
 'HDFC.NS.csv',
 'HDFCBANK.NS.csv',
 'HDFCLIFE.NS.csv',
 'HEROMOTOCO.NS.csv',
 'HINDALCO.NS.csv',
 'HINDUNILVR.NS.csv',
 'ICICIBANK.NS.csv',
 'INDUSINDBK.NS.csv',
 'INFY.NS.csv',
 'ITC.NS.csv',
 'JSWSTEEL.NS.csv',
 'KOTAKBANK.NS.csv',
 'LT.NS.csv',
 'M&M.NS.csv',
 'MARUTI.NS.csv',
 'NESTLEIND.NS.csv',
 'NTPC.NS.csv',
 'ONGC.NS.csv',
 'POWERGRID.NS.csv',
 'RELIANCE.NS.csv',
 'SBILIFE.NS.csv',
 'SBIN.NS.csv',
 'SUNPHARMA.NS.csv',
 'TATACONSUM.NS.csv',
 'TATAMOTORS.NS.csv',
 'TATASTEEL.NS.csv',
 'TCS.NS.csv',
 'TECHM.NS.csv',
 'TITAN.NS.csv',
 'ULTRACEMCO.NS.csv',
 'UPL.NS.csv',
 'WIPRO.NS.csv']

In [58]:
df = pd.read_csv(f'C:\\keshav\\Navneet_sir_all\\Nifty50_dashboard_levels\\Nifty50_Data\\{list_of_companies[20]}', usecols=['Date','Close'], index_col = 'Date')

df.rename(columns={'Close' : 'price'}, inplace=True)
company_name = f"{list_of_companies[20].split('.')[0]}"
df.insert(0,'company',company_name)

In [59]:
df

             company       price
Date
2017-11-17  HDFCLIFE  344.600006
2017-11-20  HDFCLIFE  355.350006
2017-11-21  HDFCLIFE  385.299988
2017-11-22  HDFCLIFE  395.200012
2017-11-23  HDFCLIFE  374.850006
...              ...         ...
2023-04-25  HDFCLIFE  529.750000
2023-04-26  HDFCLIFE  531.599976
2023-04-27  HDFCLIFE  517.849976
2023-04-28  HDFCLIFE  529.750000
2023-05-02  HDFCLIFE  532.200012

[1346 rows x 2 columns]

In [60]:
df['ratio'] = niftySingle['niftyPrice']/df['price']
df['mean'] = df['ratio'].mean()
df['std'] = df['ratio'].std()
df

             company       price      ratio       mean       std
Date
2017-11-17  HDFCLIFE  344.600006  29.842134  25.131325  4.789898
2017-11-20  HDFCLIFE  355.350006  28.981989  25.131325  4.789898
2017-11-21  HDFCLIFE  385.299988  26.802234  25.131325  4.789898
2017-11-22  HDFCLIFE  395.200012  26.169786  25.131325  4.789898
2017-11-23  HDFCLIFE  374.850006  27.607709  25.131325  4.789898
...              ...         ...        ...        ...       ...
2023-04-25  HDFCLIFE  529.750000  33.542709  25.131325  4.789898
2023-04-26  HDFCLIFE  531.599976  33.509406  25.131325  4.789898
2023-04-27  HDFCLIFE  517.849976  34.595060  25.131325  4.789898
2023-04-28  HDFCLIFE  529.750000  34.100991  25.131325  4.789898
2023-05-02  HDFCLIFE  532.200012  34.099305  25.131325  4.789898

[1346 rows x 5 columns]

In [61]:
## loop

combined_df = pd.DataFrame()

for company in list_of_companies:
    # print(company)

    df = pd.read_csv(f'C:\\keshav\\Navneet_sir_all\\Nifty50_dashboard_levels\\Nifty50_Data\\{company}', usecols=['Date','Close'], index_col = 'Date')
    df.rename(columns={'Close' : 'price'}, inplace=True)
    company_name = f"{company.split('.')[0]}"
    df.insert(0,'company',company_name)
    df['ratio'] = niftySingle['niftyPrice']/df['price']
    df['mean'] = df['ratio'].mean()
    df['std'] = df['ratio'].std()
    # print(df)

    combined_df = pd.concat([combined_df, df], ignore_index=False)

print(combined_df)

             company       price       ratio        mean        std
Date
2012-01-02  ADANIENT   44.242844         NaN  105.424814  68.843221
2012-01-03  ADANIENT   44.043587  108.195089  105.424814  68.843221
2012-01-04  ADANIENT   42.633457  111.406633  105.424814  68.843221
2012-01-05  ADANIENT   40.939770  116.022885  105.424814  68.843221
2012-01-06  ADANIENT   41.162018  115.497256  105.424814  68.843221
...              ...         ...         ...         ...        ...
2023-04-25     WIPRO  375.649994   47.302676   40.172821   6.895166
2023-04-26     WIPRO  374.549988   47.560006   40.172821   6.895166
2023-04-27     WIPRO  374.399994   47.850030   40.172821   6.895166
2023-04-28     WIPRO  385.000000   46.922078   40.172821   6.895166
2023-05-02     WIPRO  391.399994   46.365996   40.172821   6.895166

[136787 rows x 5 columns]

In [62]:
combined_df.to_csv('all_ticker_df.csv')